Tekla Open API Reference for Tekla Structures 2025
AnalysisPartLoadingProperties Properties
The AnalysisPartLoadingProperties type exposes the following members.
Properties
Name | Description
LoadGenerationAutoCreateFixedSupports
 Indicates whether fixed supports are automatically created.
LoadGenerationGroupIdentifierFactors
 The load generation group identifier factors.
LoadGenerationPartNames
 The load generation part names.
LoadGenerationPartNamesInclude
 Indicates whether part names are included in the load generation.
LoadGenerationSelfWeight
 Indicates whether the selfweight load is generated.
Top
See Also
Reference
AnalysisPartLoadingProperties Class
Tekla.Structures.Analysis Namespace